app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'demo_user'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();