app/Controllers/TaskController.php

INSERT INTO `tasks` (`title`, `description`, `task_date`, `status`) VALUES ('3', 'Create Database Table Schema', '2026-10-03', 'Pending')
---
    public function create()
    {
        $model = new TaskModel();

        $rules = [
            'title'     => 'required',
            'task_date' => 'required|valid_date'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }

        $model->save([
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'task_date'   => $this->request->getPost('task_date'),
            'status'      => 'Pending'
        ]);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '1'
---
    public function edit($id)
    {
        $model = new TaskModel();
        $data['task'] = $model->find($id);