app/Models/TaskModel.php

    public function getActiveTasks()
    {
        return $this->where('is_archived', 0)->findAll();
---
SELECT *
FROM `tasks`
WHERE `is_archived` = 0